# SetDocDrpShadwByCls

```pascal
PROCEDURE SetDocDrpShadwByCls(bEnable : BOOLEAN);
```

```python
def vs.SetDocDrpShadwByCls(bEnable):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|bEnable|BOOLEAN|   |

## Examples
```pascal
SetDocDrpShadwByCls(TRUE);
```
```python
import vs

bEnable = True

vs.SetDocDrpShadwByCls(bEnable)
```

## Version
Availability: from Vectorworks 2017

## Category
* Document Attributes